# name = input()
# print(name, '-чемпион!')

# ++++++++++++++++++++++++++++++++

# x = input('текст1:')
# y = input('текст2:')
# z = input('текст3:')
# print(z)
# print(y)
# print(x)

# ++++++++++++++++++++++++++++++++

# name = input()
# print('Привет', name, sep=', ', end='!')


# ++++++++++++++++++++++++++++++

# Напишите программу вычисления значения функции
# f(a, b) = 3(a + b)3 + 275b2 - 127a - 41 по введеным целым значениям а и b.
# Формат входных данных На вход программе подаётся два целых числа,
# каждое на отдельной строке. В первой строке - значение а, во второй строке
# - значение b. Формат выходных данных Программа должна вывести значение
# функции по введённым числам а и b.

# a = int(input())
# b = int(input())
# print(3 * (a + b) * (a + b) * (a + b) + 275 * b * b - 127 * a - 41)

# ++++++++++++++++++++++++++++++++++++

# x = int(input())
# y = x + 1
# z = y - 2
# print('Следующее за числом', x, 'число:', y)
# print('Для числа', x, 'предыдущее число:', z)

# ++++++++++++++++++++++++++++++++++++++

# x = int(input())
# y = int(input())
# z = int(input())
# h = int(input())
# w = (x + y + z + h)*3
# print(w)

# ++++++++++++++++++++++++++++++

# x = int(input())
# y = int(input())
# z = x + y
# h = x - y
# w = x * y
# print(f'{x} + {y} = {z}')
# print(f'{x} - {y} = {h}')
# print(f'{x} * {y} = {w}')

# ++++++++++++++++++++++++++++++

# a = int(input())
# d = int(input())
# n = int(input())
# a = (a + d * (n-1))
# print(a)

# ++++++++++++++++++++++++++++++++

# x = int(input())
# x1 = x + x
# x2 = x1 + x
# x3 = x2 + x
# x4 = x3 + x
# print(x, x1, x2, x3, x4, sep='---')

# ++++++++++++++++++++++++++++++++

# num = int(input())
# digit_1 = num // 100
# digit_2 = (num % 100) // 10
# digit_3 = num % 10
# x = digit_1 + digit_2 + digit_3
# y = digit_1 * digit_2 * digit_3
# print("Сумма цифр =", x)
# print("Произведение цифр =", y)

# ++++++++++++++++++++++++++++++++

# abc: int = int(input())
# a = abc // 100
# b = (abc % 100) // 10
# c = abc % 10
# print(a, + b, + c, sep='')
# print(a, + c, + b, sep='')
# print(b, + a, + c, sep='')
# print(b, + c, + a, sep='')
# print(c, + a, + b, sep='')
# print(c, + b, + a, sep='')

# ++++++++++++++++++++++++++++++++

# nums = int(input())
# a = nums // 1000 # получаем 1 цифру 4-х значного числа
# b = (nums % 1000) // 100 # получаем 2 цифру 4-х значного числа
# c = (nums % 100) // 10 # получаем 3 цифру 4-х значного числа
# d = nums % 10 # получаем 4 цифру 4-х значного числа
# print('Цифра в позиции тысяч равна', a)
# print('Цифра в позиции сотен равна', b)
# print('Цифра в позиции десятков равна', c)
# print('Цифра в позиции единиц равна', d)

# ++++++++++++++++++++++++++++++++

# n = int(input())
# print(n*123)




