"""
Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.

    *Пример:*

    - [2, 3, 4, 5, 6] => [12, 15, 16];
    - [2, 3, 5, 6] => [12, 15]
"""

def multiply_sp(sp_1):
    if len(sp_1) % 2 != 0:
        print("Количество элементов списка не четное!")
        rz = int(len(sp_1) / 2) + 1
    else:
        rz = int(len(sp_1) / 2)

    mult = []
    for i in range(0, rz):
        mult.append(sp_1[i] * sp_1[len(sp_1) - 1 - i])
    return mult


if __name__ == "__main__":
    #    sp = [2, 3, 4, 5, 6]
    sp = [2, 3, 5, 6]
    print(sp, " => ", multiply_sp(sp))
